app/views/comments/_form.html.erb

    <%= form.label :user_id %>
    <%= form.collection_select :user_id, User.all, :id, :name,{} ,{ class: "form-control"} %>
---
SELECT `users`.* FROM `users`