app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`content`, `post_id`, `user_id`, `created_at`, `updated_at`) VALUES ('ldldlldl', 1, 1, '2020-03-27 01:32:04', '2020-03-27 01:32:04')