app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`updated_at` DESC

  def show
    @comment = Comment.new()
    @comments = @post.comments.order("created_at DESC")
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 17 ORDER BY created_at DESC

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`title`, `body`, `user_id`, `created_at`, `updated_at`) VALUES ('zalabia', 'mdmmdmd', 1, '2020-03-25 21:46:21', '2020-03-25 21:46:21')

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE `posts` SET `body` = 'moh\r\nlalalal\r\nlalalal', `updated_at` = '2020-03-25 21:25:03' WHERE `posts`.`id` = 5