app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `created_at`, `updated_at`) VALUES ('mohamed', '2020-03-25 12:28:18', '2020-03-25 12:28:18')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `name` = 'mohamed', `updated_at` = '2020-03-25 14:04:01' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      if @user.update(user_params)